Revit 2027 API
BuiltInFailures.StairRampFailures.NotchThicknessIsLargerThanLandingWarning Property
 The notch thickness is larger than landing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotchThicknessIsLargerThanLandingWarning { get; }
Public Shared ReadOnly Property NotchThicknessIsLargerThanLandingWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotchThicknessIsLargerThanLandingWarning {
	FailureDefinitionId^ get ();
}
static member NotchThicknessIsLargerThanLandingWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace